reddit_clone/app/views/posts/_form.html.erb

<label class="sub-radios">Choose SubReddits:<br>
  <%Sub.all.each do |subr|%>
---
SELECT "subs".* FROM "subs"