reddit_clone/app/views/posts/show.html.erb

<h2><%= @post.title %></h2>
<h4>Author: <a href="#"><%=User.find(@post.author_id).username%></a></h5>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]