reddit_clone/app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    @post.sub_id = params[:sub_id]
    @post.author_id = current_user.id
    if @post.save!
---
INSERT INTO "post_subs" ("sub_id", "post_id") VALUES ($1, $2) RETURNING "id"  [["sub_id", 1], ["post_id", 4]]
INSERT INTO "posts" ("title", "url", "content", "sub_id", "author_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"