reddit_clone/app/controllers/subs_controller.rb

  def create
    @sub = Sub.new(sub_params)
    @sub.moderator_id = current_user.id
    if @sub.save
---
INSERT INTO "subs" ("title", "description", "moderator_id") VALUES ($1, $2, $3) RETURNING "id"  [["title", "Doggos"], ["description", "borkbork"], ["moderator_id", 2]]

  def edit
    # SubsController.require_moderator
    @sub = Sub.find(params[:id])
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    @sub = Sub.find(params[:id])
    if @sub.update_attributes(sub_params)
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "subs" SET "title" = $1, "description" = $2 WHERE "subs"."id" = $3  [["title", "Whatever I want!?"], ["description", "still doggiez"], ["id", 1]]