reddit_clone/app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password_digest", "session_token") VALUES ($1, $2, $3) RETURNING "id"  [["username", "rich"], ["password_digest", "$2a$10$xj45gC7rdInaq2EIB4XhieMQKzLdUf9A4wdWur0mbKL/TUcKjgt8K"], ["session_token", "GrUvntARjb9iOLtdoNwhCw"]]
---
  def create
    @user = User.new(user_params)
    if @user.save